data/case/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*-----------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.19298;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0.19298;
    }

    outlet
    {
        type            calculated;
        value           uniform 0.19298;
    }

    farfieldSide
    {
        type            calculated;
        value           uniform 0.19298;
    }

    farfieldBottom
    {
        type            calculated;
        value           uniform 0.19298;
    }

    farfieldTop
    {
        type            calculated;
        value           uniform 0.19298;
    }

    symmetry
    {
        type            symmetryPlane;
    }

    onera
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}

// ************************************************************************* //
